; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	thermograph1 - mode
	thermograph0 - mode
	spectrograph2 - mode
	image3 - mode
	GroundStation2 - direction
	GroundStation5 - direction
	GroundStation7 - direction
	GroundStation8 - direction
	Star9 - direction
	Star11 - direction
	GroundStation12 - direction
	Star13 - direction
	Star10 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation6 - direction
	Star14 - direction
	Star4 - direction
	GroundStation3 - direction
	Star15 - direction
	Planet16 - direction
	Star17 - direction
	Star18 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 thermograph1)
	(supports instrument0 image3)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 Star14)
	(calibration_target instrument0 Star10)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star17)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star14)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 thermograph0)
	(supports instrument2 thermograph1)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 Star4)
	(supports instrument3 image3)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star18)
)
(:goal (and
	(have_image Star15 spectrograph2)
	(have_image Planet16 spectrograph2)
	(have_image Star17 thermograph0)
	(have_image Star18 spectrograph2)
))

)

; plan
1. (turn_to satellite1 star4 star18)
   deleted: (pointing satellite1 star18)
   added: (pointing satellite1 star4)
   goals met: 0 of 4
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 4
3. (calibrate satellite1 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 0 of 4
4. (turn_to satellite1 star15 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 star15)
   goals met: 0 of 4
5. (take_image satellite1 star15 instrument2 spectrograph2)
   added: (have_image star15 spectrograph2)
   goals met: 1 of 4
6. (turn_to satellite1 planet16 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 planet16)
   goals met: 1 of 4
7. (take_image satellite1 planet16 instrument2 spectrograph2)
   added: (have_image planet16 spectrograph2)
   goals met: 2 of 4
8. (turn_to satellite1 star17 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 star17)
   goals met: 2 of 4
9. (take_image satellite1 star17 instrument2 thermograph0)
   added: (have_image star17 thermograph0)
   goals met: 3 of 4
10. (turn_to satellite1 star18 star17)
   deleted: (pointing satellite1 star17)
   added: (pointing satellite1 star18)
   goals met: 3 of 4
11. (take_image satellite1 star18 instrument2 spectrograph2)
   added: (have_image star18 spectrograph2)
   goals met: 4 of 4
